[ 
    { "Analytics Terms" : 
        [ {
            "API" : "API stands for Application Programming Interface which is a set of functions and procedures that allow the creation of applications which access the features or data of an operating system, application, or other services. An API is how computers and web applications share information with each other. An example: an app finds the current weather in Sydney by sending a message to the weather.com API. The weather.com API then replies with a structured response.\n An API is how computers and web applications share information with each other. For example, an App finds the current weather in Sydney by sending a message to the weather.com API. The weather.com API then replies with a structured response.",
            "Agile" : "Agile development is a technique for incremental software development. It is an umbrella term for several different types of methodologies. It focuses on keeping the code simple, testing often, and delivering functional parts of the application as soon as they’re ready.",
            "Amplification" : "Amplification could be defined as the probability that one’s message will produce activities (retweets, @messages, likes, and remarks.\n By keeping track of amplification, you can make sure that you dedicate a certain amount of time on your content and move on with next activity.Without amplification, there is a possibility of wasting ample amount of time on something which would not be appreciated or received well by the intended audience.Amplification metric would not only help in your time management but it will also provide you with the expectant measured success of your new blog or posts.",
            "Inbound Links" : "Whenever you are posting, commenting on any social media platform, you have to make sure that you provide a user with sufficient inbound links which leads back to your website, blog or landing page.If you provide the user with relevant information, with an inbound link leading back to your home page, it would not only increase your conversion rate but only improve your ranking on Search Engine because Sites that get numerous inbound connections can probably rank higher in web search tools. Essentially, inbound connections tell web page crawlers that your site is an expert on a specific subject – so the more inbound connections you have, the better your site can rank in internet searcher comes about pages (SERPs).",
            "Optimal Engagement Time" : "Everyone in this Digital Era has a specific time of the day which he dedicates to the browsing of social media, for some it could be during their regular commute, or while taking a break from work or while having dinner.\n Optimal Engagement time that metric which is used to measure that time of day which has the highest frequency of people commenting, liking or retweeting your post in a span of a particular time frame.\n By knowing our optimal engagement time, we can make schedule our posts in such manner that chances of it’s reaching out towards ideal clients and followers become highest.",
            "Bounce Rate" : "Suppose, you have curated some great content ( in your opinion), but even if the number of visitors on your landing page has increased exponentially, so is the number of people who land on your page and leave without even viewing other pages.\n This percentage sudden abandonment of viewers is known as Bounce Rate. Keeping track of Bounce Rate is important because it gives you an idea about the content which is stopping your intended audience to engage with your product.\n Not only this but having insights about the Bounce Rate would also give you information about the perceptive of your clients so that you can create content tendering to your client’s taste.",
            "Post Reach And Engagement" : "Keeping track of your post reach on diversified media platforms and its engagement with your followers/fan base could be extremely consequential.\n \n Post Reach: Total Reach gives you insights about the number of extraordinary individuals who have seen any content related to your Page, tweets, posts including promotions and advertisements amid a certain time period. \n Post Reach demonstrates the number of people who could be tempted to become your follower or prospects.\n \n Social Engagement: Social Engagement is the term that gives you information about which content or post of yours is liked and shared most and on which platform, so that you can weed out unnecessary content and could focus on more data driven and audience oriented posts.",
            "Follower Count" : "Working hard and implementing a social media marketing strategy without keeping a check on follower count is not only foolhardy but also counter-productive.
            \n While developing a plan to augment your presence on digital platforms, it will be a colossal mistake to not to keep a track of your follower count.
            \n Your regular check of followers will inform you about the quantity and type of people who have appreciated, liked and are interested in your business.
            \n You have to reliably, consistently and sustainably develop your following. This means that content you’re sharing and the ways you’re connecting with your followers should be luring enough to draw and attract new followers.",
            "Interaction Analysis" : "The main motive of increasing your digital presence is to interact with your clients and followers on the regular basis and interaction analysis is that metric which is used in keeping track of comments, likes and replies on your posts.
            
            You can observe how captivating and interesting your content is by the number of comments and remarks your content.
            Interaction analysis will provide you with measurements so that you get rid of uninteresting content from your marketing strategy and focus on something which is well liked and well received by your intended audience.
            
            ",
            "Viewer Demographic" : "If you are an up and coming marketer or even an entrepreneur, who is just delving into the vast arena of Digital and Social Marketing, knowing your demographics of your viewers, followers and intended customers is very vital for the growth of your business.
            
            As you develop and increase the number of your followers, observing the likes and dislikes and demographics of people can point out the appropriate and optimum direction for your future strategy, by enabling you to alter your content, posts and could allow you to choose the type of advertisements for future promotions of your Brand or Business.
            
            ",
            "Mentions" : "Mention is a metric that keeps tracks on where your business/username is mentioned.
            Your followers and prospects are out there discussing you or your business and you need to be aware of that discussion.
            Apart from that, it’s essential to track your notices. On Facebook and Twitter, you’ll get notices at whatever point somebody labels your business/username in their post or comments.
            Monitoring mentions are important because you can interact with your clients and prospects, answer and resolve their queries and can strengthen your relationship with your client.",
            "Link Clicks" : "Link clicks is a metrics which shows the number of clicks on a link so that you can understand the popularity of a particular topic.
            Link click shows the total number of time a recipient clicked on your article/blog/newsletter.
            This immediate reaction metric encourages you to decide if your followers are keen on what you’re as of now posting and educates you on the type of content you should share later on to increase the follower engagement, keep track of popular content so that you can build a good and loyal follower base, some of which you can convert into your potential prospects.",
            "Customer Reporting" : "A Google Analytics report that includes only that information you want to show based on dimensions and metrics you choose.",
            "Entrance Page" : "It is a page on your website where customer landed first. Usually, the home page has the highest number of landings.",
            "New Visitor" : "A user who visits the website for the first time. Also, a user who had visited the website previously but due to some reason if they had deleted cookies, history or used private browsing mode is considered as New Visitor.",
            "Parameters" : "These are tags added at the end of URL addresses in order to define the source, the traffic is coming from to the website.",
            "Organic Traffic" : "Organic Traffic is when a user visits a website using an unpaid(organic) search engine.",
            "Goals" : "Goals are the actions that you want users to perform on your website that are defined as success. The action has to be a substantial one such as purchase, download or contact."

        } ]
    }
]
